verification/runs/T-family/T5_runs/P_m/constant/air/radiationProperties
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location "constant/air";
    object radiationProperties;
}

radiation off;
radiationModel none;
