verification/runs/T-family/T5_runs/P_m/constant/regionProperties
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location "constant";
    object regionProperties;
}

regions
(
    fluid (air)
    solid (epoxy)
);
