verification/runs/T-family/T5_runs/P_m/system/blockMeshDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location "system";
    object blockMeshDict;
}

scale 1;

vertices
(
    (-0.12 0 0)
    (0 0 0)
    (0.0015 0 0)
    (0.0135 0 0)
    (0.015 0 0)
    (0.3 0 0)
    (-0.12 0.0005 0)
    (0 0.0005 0)
    (0.0015 0.0005 0)
    (0.0135 0.0005 0)
    (0.015 0.0005 0)
    (0.3 0.0005 0)
    (-0.12 0.0015 0)
    (0 0.0015 0)
    (0.0015 0.0015 0)
    (0.0135 0.0015 0)
    (0.015 0.0015 0)
    (0.3 0.0015 0)
    (-0.12 0.0135 0)
    (0 0.0135 0)
    (0.0015 0.0135 0)
    (0.0135 0.0135 0)
    (0.015 0.0135 0)
    (0.3 0.0135 0)
    (-0.12 0.015 0)
    (0 0.015 0)
    (0.0015 0.015 0)
    (0.0135 0.015 0)
    (0.015 0.015 0)
    (0.3 0.015 0)
    (-0.12 0.051 0)
    (0 0.051 0)
    (0.0015 0.051 0)
    (0.0135 0.051 0)
    (0.015 0.051 0)
    (0.3 0.051 0)
    (-0.12 0 0.006)
    (0 0 0.006)
    (0.0015 0 0.006)
    (0.0135 0 0.006)
    (0.015 0 0.006)
    (0.3 0 0.006)
    (-0.12 0.0005 0.006)
    (0 0.0005 0.006)
    (0.0015 0.0005 0.006)
    (0.0135 0.0005 0.006)
    (0.015 0.0005 0.006)
    (0.3 0.0005 0.006)
    (-0.12 0.0015 0.006)
    (0 0.0015 0.006)
    (0.0015 0.0015 0.006)
    (0.0135 0.0015 0.006)
    (0.015 0.0015 0.006)
    (0.3 0.0015 0.006)
    (-0.12 0.0135 0.006)
    (0 0.0135 0.006)
    (0.0015 0.0135 0.006)
    (0.0135 0.0135 0.006)
    (0.015 0.0135 0.006)
    (0.3 0.0135 0.006)
    (-0.12 0.015 0.006)
    (0 0.015 0.006)
    (0.0015 0.015 0.006)
    (0.0135 0.015 0.006)
    (0.015 0.015 0.006)
    (0.3 0.015 0.006)
    (-0.12 0.051 0.006)
    (0 0.051 0.006)
    (0.0015 0.051 0.006)
    (0.0135 0.051 0.006)
    (0.015 0.051 0.006)
    (0.3 0.051 0.006)
    (-0.12 0 0.0075)
    (0 0 0.0075)
    (0.0015 0 0.0075)
    (0.0135 0 0.0075)
    (0.015 0 0.0075)
    (0.3 0 0.0075)
    (-0.12 0.0005 0.0075)
    (0 0.0005 0.0075)
    (0.0015 0.0005 0.0075)
    (0.0135 0.0005 0.0075)
    (0.015 0.0005 0.0075)
    (0.3 0.0005 0.0075)
    (-0.12 0.0015 0.0075)
    (0 0.0015 0.0075)
    (0.0015 0.0015 0.0075)
    (0.0135 0.0015 0.0075)
    (0.015 0.0015 0.0075)
    (0.3 0.0015 0.0075)
    (-0.12 0.0135 0.0075)
    (0 0.0135 0.0075)
    (0.0015 0.0135 0.0075)
    (0.0135 0.0135 0.0075)
    (0.015 0.0135 0.0075)
    (0.3 0.0135 0.0075)
    (-0.12 0.015 0.0075)
    (0 0.015 0.0075)
    (0.0015 0.015 0.0075)
    (0.0135 0.015 0.0075)
    (0.015 0.015 0.0075)
    (0.3 0.015 0.0075)
    (-0.12 0.051 0.0075)
    (0 0.051 0.0075)
    (0.0015 0.051 0.0075)
    (0.0135 0.051 0.0075)
    (0.015 0.051 0.0075)
    (0.3 0.051 0.0075)
    (-0.12 0 0.075)
    (0 0 0.075)
    (0.0015 0 0.075)
    (0.0135 0 0.075)
    (0.015 0 0.075)
    (0.3 0 0.075)
    (-0.12 0.0005 0.075)
    (0 0.0005 0.075)
    (0.0015 0.0005 0.075)
    (0.0135 0.0005 0.075)
    (0.015 0.0005 0.075)
    (0.3 0.0005 0.075)
    (-0.12 0.0015 0.075)
    (0 0.0015 0.075)
    (0.0015 0.0015 0.075)
    (0.0135 0.0015 0.075)
    (0.015 0.0015 0.075)
    (0.3 0.0015 0.075)
    (-0.12 0.0135 0.075)
    (0 0.0135 0.075)
    (0.0015 0.0135 0.075)
    (0.0135 0.0135 0.075)
    (0.015 0.0135 0.075)
    (0.3 0.0135 0.075)
    (-0.12 0.015 0.075)
    (0 0.015 0.075)
    (0.0015 0.015 0.075)
    (0.0135 0.015 0.075)
    (0.015 0.015 0.075)
    (0.3 0.015 0.075)
    (-0.12 0.051 0.075)
    (0 0.051 0.075)
    (0.0015 0.051 0.075)
    (0.0135 0.051 0.075)
    (0.015 0.051 0.075)
    (0.3 0.051 0.075)
);

blocks
(
    hex (0 1 7 6 36 37 43 42) air (38 3 8) simpleGrading (((0.75 0.394737 1) (0.25 0.605263 0.0151945)) 3.40479 1)
    hex (1 2 8 7 37 38 44 43) epoxy (3 3 8) simpleGrading (1 3.40479 1)
    hex (2 3 9 8 38 39 45 44) epoxy (14 3 8) simpleGrading (1 3.40479 1)
    hex (3 4 10 9 39 40 46 45) epoxy (3 3 8) simpleGrading (1 3.40479 1)
    hex (4 5 11 10 40 41 47 46) air (51 3 8) simpleGrading (((0.25 0.607843 135.236) (0.75 0.392157 1)) 3.40479 1)
    hex (6 7 13 12 42 43 49 48) air (38 2 8) simpleGrading (((0.75 0.394737 1) (0.25 0.605263 0.0151945)) 1 1)
    hex (7 8 14 13 43 44 50 49) epoxy (3 2 8) simpleGrading (1 1 1)
    hex (8 9 15 14 44 45 51 50) epoxy (14 2 8) simpleGrading (1 1 1)
    hex (9 10 16 15 45 46 52 51) epoxy (3 2 8) simpleGrading (1 1 1)
    hex (10 11 17 16 46 47 53 52) air (51 2 8) simpleGrading (((0.25 0.607843 135.236) (0.75 0.392157 1)) 1 1)
    hex (12 13 19 18 48 49 55 54) air (38 14 8) simpleGrading (((0.75 0.394737 1) (0.25 0.605263 0.0151945)) 1 1)
    hex (13 14 20 19 49 50 56 55) epoxy (3 14 8) simpleGrading (1 1 1)
    hex (15 16 22 21 51 52 58 57) epoxy (3 14 8) simpleGrading (1 1 1)
    hex (16 17 23 22 52 53 59 58) air (51 14 8) simpleGrading (((0.25 0.607843 135.236) (0.75 0.392157 1)) 1 1)
    hex (18 19 25 24 54 55 61 60) air (38 3 8) simpleGrading (((0.75 0.394737 1) (0.25 0.605263 0.0151945)) 1 1)
    hex (19 20 26 25 55 56 62 61) epoxy (3 3 8) simpleGrading (1 1 1)
    hex (20 21 27 26 56 57 63 62) epoxy (14 3 8) simpleGrading (1 1 1)
    hex (21 22 28 27 57 58 64 63) epoxy (3 3 8) simpleGrading (1 1 1)
    hex (22 23 29 28 58 59 65 64) air (51 3 8) simpleGrading (((0.25 0.607843 135.236) (0.75 0.392157 1)) 1 1)
    hex (24 25 31 30 60 61 67 66) air (38 32 8) simpleGrading (((0.75 0.394737 1) (0.25 0.605263 0.0151945)) ((0.5 0.5 53.1172) (0.5 0.5 0.0188263)) 1)
    hex (25 26 32 31 61 62 68 67) air (3 32 8) simpleGrading (1 ((0.5 0.5 53.1172) (0.5 0.5 0.0188263)) 1)
    hex (26 27 33 32 62 63 69 68) air (14 32 8) simpleGrading (1 ((0.5 0.5 53.1172) (0.5 0.5 0.0188263)) 1)
    hex (27 28 34 33 63 64 70 69) air (3 32 8) simpleGrading (1 ((0.5 0.5 53.1172) (0.5 0.5 0.0188263)) 1)
    hex (28 29 35 34 64 65 71 70) air (51 32 8) simpleGrading (((0.25 0.607843 135.236) (0.75 0.392157 1)) ((0.5 0.5 53.1172) (0.5 0.5 0.0188263)) 1)
    hex (36 37 43 42 72 73 79 78) air (38 3 3) simpleGrading (((0.75 0.394737 1) (0.25 0.605263 0.0151945)) 3.40479 1)
    hex (37 38 44 43 73 74 80 79) epoxy (3 3 3) simpleGrading (1 3.40479 1)
    hex (38 39 45 44 74 75 81 80) epoxy (14 3 3) simpleGrading (1 3.40479 1)
    hex (39 40 46 45 75 76 82 81) epoxy (3 3 3) simpleGrading (1 3.40479 1)
    hex (40 41 47 46 76 77 83 82) air (51 3 3) simpleGrading (((0.25 0.607843 135.236) (0.75 0.392157 1)) 3.40479 1)
    hex (42 43 49 48 78 79 85 84) air (38 2 3) simpleGrading (((0.75 0.394737 1) (0.25 0.605263 0.0151945)) 1 1)
    hex (43 44 50 49 79 80 86 85) epoxy (3 2 3) simpleGrading (1 1 1)
    hex (44 45 51 50 80 81 87 86) epoxy (14 2 3) simpleGrading (1 1 1)
    hex (45 46 52 51 81 82 88 87) epoxy (3 2 3) simpleGrading (1 1 1)
    hex (46 47 53 52 82 83 89 88) air (51 2 3) simpleGrading (((0.25 0.607843 135.236) (0.75 0.392157 1)) 1 1)
    hex (48 49 55 54 84 85 91 90) air (38 14 3) simpleGrading (((0.75 0.394737 1) (0.25 0.605263 0.0151945)) 1 1)
    hex (49 50 56 55 85 86 92 91) epoxy (3 14 3) simpleGrading (1 1 1)
    hex (50 51 57 56 86 87 93 92) epoxy (14 14 3) simpleGrading (1 1 1)
    hex (51 52 58 57 87 88 94 93) epoxy (3 14 3) simpleGrading (1 1 1)
    hex (52 53 59 58 88 89 95 94) air (51 14 3) simpleGrading (((0.25 0.607843 135.236) (0.75 0.392157 1)) 1 1)
    hex (54 55 61 60 90 91 97 96) air (38 3 3) simpleGrading (((0.75 0.394737 1) (0.25 0.605263 0.0151945)) 1 1)
    hex (55 56 62 61 91 92 98 97) epoxy (3 3 3) simpleGrading (1 1 1)
    hex (56 57 63 62 92 93 99 98) epoxy (14 3 3) simpleGrading (1 1 1)
    hex (57 58 64 63 93 94 100 99) epoxy (3 3 3) simpleGrading (1 1 1)
    hex (58 59 65 64 94 95 101 100) air (51 3 3) simpleGrading (((0.25 0.607843 135.236) (0.75 0.392157 1)) 1 1)
    hex (60 61 67 66 96 97 103 102) air (38 32 3) simpleGrading (((0.75 0.394737 1) (0.25 0.605263 0.0151945)) ((0.5 0.5 53.1172) (0.5 0.5 0.0188263)) 1)
    hex (61 62 68 67 97 98 104 103) air (3 32 3) simpleGrading (1 ((0.5 0.5 53.1172) (0.5 0.5 0.0188263)) 1)
    hex (62 63 69 68 98 99 105 104) air (14 32 3) simpleGrading (1 ((0.5 0.5 53.1172) (0.5 0.5 0.0188263)) 1)
    hex (63 64 70 69 99 100 106 105) air (3 32 3) simpleGrading (1 ((0.5 0.5 53.1172) (0.5 0.5 0.0188263)) 1)
    hex (64 65 71 70 100 101 107 106) air (51 32 3) simpleGrading (((0.25 0.607843 135.236) (0.75 0.392157 1)) ((0.5 0.5 53.1172) (0.5 0.5 0.0188263)) 1)
    hex (72 73 79 78 108 109 115 114) air (38 3 26) simpleGrading (((0.75 0.394737 1) (0.25 0.605263 0.0151945)) 3.40479 ((0.25 0.615385 48.9699) (0.75 0.384615 1)))
    hex (73 74 80 79 109 110 116 115) air (3 3 26) simpleGrading (1 3.40479 ((0.25 0.615385 48.9699) (0.75 0.384615 1)))
    hex (74 75 81 80 110 111 117 116) air (14 3 26) simpleGrading (1 3.40479 ((0.25 0.615385 48.9699) (0.75 0.384615 1)))
    hex (75 76 82 81 111 112 118 117) air (3 3 26) simpleGrading (1 3.40479 ((0.25 0.615385 48.9699) (0.75 0.384615 1)))
    hex (76 77 83 82 112 113 119 118) air (51 3 26) simpleGrading (((0.25 0.607843 135.236) (0.75 0.392157 1)) 3.40479 ((0.25 0.615385 48.9699) (0.75 0.384615 1)))
    hex (78 79 85 84 114 115 121 120) air (38 2 26) simpleGrading (((0.75 0.394737 1) (0.25 0.605263 0.0151945)) 1 ((0.25 0.615385 48.9699) (0.75 0.384615 1)))
    hex (79 80 86 85 115 116 122 121) air (3 2 26) simpleGrading (1 1 ((0.25 0.615385 48.9699) (0.75 0.384615 1)))
    hex (80 81 87 86 116 117 123 122) air (14 2 26) simpleGrading (1 1 ((0.25 0.615385 48.9699) (0.75 0.384615 1)))
    hex (81 82 88 87 117 118 124 123) air (3 2 26) simpleGrading (1 1 ((0.25 0.615385 48.9699) (0.75 0.384615 1)))
    hex (82 83 89 88 118 119 125 124) air (51 2 26) simpleGrading (((0.25 0.607843 135.236) (0.75 0.392157 1)) 1 ((0.25 0.615385 48.9699) (0.75 0.384615 1)))
    hex (84 85 91 90 120 121 127 126) air (38 14 26) simpleGrading (((0.75 0.394737 1) (0.25 0.605263 0.0151945)) 1 ((0.25 0.615385 48.9699) (0.75 0.384615 1)))
    hex (85 86 92 91 121 122 128 127) air (3 14 26) simpleGrading (1 1 ((0.25 0.615385 48.9699) (0.75 0.384615 1)))
    hex (86 87 93 92 122 123 129 128) air (14 14 26) simpleGrading (1 1 ((0.25 0.615385 48.9699) (0.75 0.384615 1)))
    hex (87 88 94 93 123 124 130 129) air (3 14 26) simpleGrading (1 1 ((0.25 0.615385 48.9699) (0.75 0.384615 1)))
    hex (88 89 95 94 124 125 131 130) air (51 14 26) simpleGrading (((0.25 0.607843 135.236) (0.75 0.392157 1)) 1 ((0.25 0.615385 48.9699) (0.75 0.384615 1)))
    hex (90 91 97 96 126 127 133 132) air (38 3 26) simpleGrading (((0.75 0.394737 1) (0.25 0.605263 0.0151945)) 1 ((0.25 0.615385 48.9699) (0.75 0.384615 1)))
    hex (91 92 98 97 127 128 134 133) air (3 3 26) simpleGrading (1 1 ((0.25 0.615385 48.9699) (0.75 0.384615 1)))
    hex (92 93 99 98 128 129 135 134) air (14 3 26) simpleGrading (1 1 ((0.25 0.615385 48.9699) (0.75 0.384615 1)))
    hex (93 94 100 99 129 130 136 135) air (3 3 26) simpleGrading (1 1 ((0.25 0.615385 48.9699) (0.75 0.384615 1)))
    hex (94 95 101 100 130 131 137 136) air (51 3 26) simpleGrading (((0.25 0.607843 135.236) (0.75 0.392157 1)) 1 ((0.25 0.615385 48.9699) (0.75 0.384615 1)))
    hex (96 97 103 102 132 133 139 138) air (38 32 26) simpleGrading (((0.75 0.394737 1) (0.25 0.605263 0.0151945)) ((0.5 0.5 53.1172) (0.5 0.5 0.0188263)) ((0.25 0.615385 48.9699) (0.75 0.384615 1)))
    hex (97 98 104 103 133 134 140 139) air (3 32 26) simpleGrading (1 ((0.5 0.5 53.1172) (0.5 0.5 0.0188263)) ((0.25 0.615385 48.9699) (0.75 0.384615 1)))
    hex (98 99 105 104 134 135 141 140) air (14 32 26) simpleGrading (1 ((0.5 0.5 53.1172) (0.5 0.5 0.0188263)) ((0.25 0.615385 48.9699) (0.75 0.384615 1)))
    hex (99 100 106 105 135 136 142 141) air (3 32 26) simpleGrading (1 ((0.5 0.5 53.1172) (0.5 0.5 0.0188263)) ((0.25 0.615385 48.9699) (0.75 0.384615 1)))
    hex (100 101 107 106 136 137 143 142) air (51 32 26) simpleGrading (((0.25 0.607843 135.236) (0.75 0.392157 1)) ((0.5 0.5 53.1172) (0.5 0.5 0.0188263)) ((0.25 0.615385 48.9699) (0.75 0.384615 1)))
);

edges ();

boundary
(
    inlet { type patch; faces (
        (0 36 42 6)
        (6 42 48 12)
        (12 48 54 18)
        (18 54 60 24)
        (24 60 66 30)
        (36 72 78 42)
        (42 78 84 48)
        (48 84 90 54)
        (54 90 96 60)
        (60 96 102 66)
        (72 108 114 78)
        (78 114 120 84)
        (84 120 126 90)
        (90 126 132 96)
        (96 132 138 102)
    ); }
    outlet { type patch; faces (
        (5 11 47 41)
        (11 17 53 47)
        (17 23 59 53)
        (23 29 65 59)
        (29 35 71 65)
        (41 47 83 77)
        (47 53 89 83)
        (53 59 95 89)
        (59 65 101 95)
        (65 71 107 101)
        (77 83 119 113)
        (83 89 125 119)
        (89 95 131 125)
        (95 101 137 131)
        (101 107 143 137)
    ); }
    floor { type wall; faces (
        (0 1 37 36)
        (4 5 41 40)
        (36 37 73 72)
        (40 41 77 76)
        (72 73 109 108)
        (73 74 110 109)
        (74 75 111 110)
        (75 76 112 111)
        (76 77 113 112)
    ); }
    cube_bottom { type wall; faces (
        (1 2 38 37)
        (2 3 39 38)
        (3 4 40 39)
        (37 38 74 73)
        (38 39 75 74)
        (39 40 76 75)
    ); }
    roof { type wall; faces (
        (30 66 67 31)
        (31 67 68 32)
        (32 68 69 33)
        (33 69 70 34)
        (34 70 71 35)
        (66 102 103 67)
        (67 103 104 68)
        (68 104 105 69)
        (69 105 106 70)
        (70 106 107 71)
        (102 138 139 103)
        (103 139 140 104)
        (104 140 141 105)
        (105 141 142 106)
        (106 142 143 107)
    ); }
    symmetry { type symmetryPlane; faces (
        (0 6 7 1)
        (1 7 8 2)
        (2 8 9 3)
        (3 9 10 4)
        (4 10 11 5)
        (6 12 13 7)
        (7 13 14 8)
        (8 14 15 9)
        (9 15 16 10)
        (10 16 17 11)
        (12 18 19 13)
        (13 19 20 14)
        (15 21 22 16)
        (16 22 23 17)
        (18 24 25 19)
        (19 25 26 20)
        (20 26 27 21)
        (21 27 28 22)
        (22 28 29 23)
        (24 30 31 25)
        (25 31 32 26)
        (26 32 33 27)
        (27 33 34 28)
        (28 34 35 29)
    ); }
    side { type patch; faces (
        (108 109 115 114)
        (109 110 116 115)
        (110 111 117 116)
        (111 112 118 117)
        (112 113 119 118)
        (114 115 121 120)
        (115 116 122 121)
        (116 117 123 122)
        (117 118 124 123)
        (118 119 125 124)
        (120 121 127 126)
        (121 122 128 127)
        (122 123 129 128)
        (123 124 130 129)
        (124 125 131 130)
        (126 127 133 132)
        (127 128 134 133)
        (128 129 135 134)
        (129 130 136 135)
        (130 131 137 136)
        (132 133 139 138)
        (133 134 140 139)
        (134 135 141 140)
        (135 136 142 141)
        (136 137 143 142)
    ); }
    core { type wall; faces (
        (14 50 56 20)
        (15 21 57 51)
        (14 15 51 50)
        (20 56 57 21)
        (50 51 57 56)
    ); }
);

mergePatchPairs ();
