verification/runs/T-family/T5_runs/P_m/system/controlDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location "system";
    object controlDict;
}

application     chtMultiRegionSimpleFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         5000;
deltaT          1;
writeControl    timeStep;
writeInterval   1000;
purgeWrite      3;
writeFormat     ascii;
writePrecision  10;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable false;

functions
{
    yPlus
    {
        type            yPlus;
        libs            (fieldFunctionObjects);
        region          air;
        writeControl    writeTime;
        writeInterval   1000;
    }
    wallHeatFlux
    {
        type            wallHeatFlux;
        libs            (fieldFunctionObjects);
        region          air;
        patches         (cube_front cube_top cube_rear cube_side_n floor roof);
        writeControl    writeTime;
        writeInterval   1000;
    }
}

libs ( "libfieldFunctionObjects.so" );
